{
    "name": "",
    "headerTaglineOne": "Bonjour 👋",
    "headerTaglineTwo": "Je suis Slimane BERRADA Developpeur full-stack",
    "headerTaglineThree": "Actuellement sur Paris,France",
    "headerTaglineFour": "",
    "showCursor": false,
    "showBlog": false,
    "darkMode": true,
    "showResume": true,
    "socials": [
        {
            "id": "1",
            "title": "Github",
            "link": "https://github.com/slimanitz"
        },
        {
            "id": "2",
            "title": "LinkedIn",
            "link": "https://www.linkedin.com/in/slimane-b-944936155/"
        },
        {
            "id": "5",
            "title": "Email",
            "link": "mailto:slimane.berrada.01@gmail.com"
        }
    ],
    "projects": [
        {
            "id": "1",
            "title": "Capousse",
            "description": "Site web e-commerce",
            "imageSrc": "https://i.ibb.co/7JWxS4D/Screenshot-2024-06-16-at-10-45-31.png",
            "url": "https://capousse.ma"
        },
        {
            "id": "2",
            "title": "Application du filtre Gaussien sur image avec CUDA",
            "description": "Cuda development",
            "imageSrc": "https://i.ibb.co/znRS6P5/Screenshot-2024-06-16-at-10-48-38.png",
            "url": "https://github.com/slimanitz/cuda"
        }
    ],
    "services": [
        {
            "id": "1",
            "title": "Développement web",
            "description": "J'aide les entreprises a développer leur activité en ligne en proposant mon service de développement web"
        },
        {
            "id": "2",
            "title": "Développement backend ",
            "description": "J'aide les entreprises a améliorer leurs performances au niveau du serveur tout en ajoutant mon expertise pour de possibles integrations"
        },
        {
            "id": "3",
            "title": "Web Design",
            "description": "J'aide au design des applications web"
        }
    ],
    "aboutpara": "Slimane BERRADA - Développeur Full Stack\n\nPassionné par l'univers du développement web, je suis Slimane BERRADA, un développeur full stack avec une expertise approfondie en création et optimisation d'applications web modernes. Avec plusieurs années d'expérience dans le domaine, j'ai acquis une maîtrise avancée des technologies front-end et back-end, me permettant de concevoir des solutions complètes et performantes. Je maîtrise parfaitement HTML5, CSS3, JavaScript (ES6+), React, Angular, Vue.js, SASS, LESS, Webpack, Gulp, Node.js, Python, PHP, Express.js, Django, Laravel, MySQL, PostgreSQL, MongoDB, API RESTful et GraphQL. Je suis également compétent en DevOps (Docker, Kubernetes, CI/CD), cloud (AWS, Azure, Google Cloud), gestion de versions (Git, GitHub, GitLab) et méthodologies agiles (Scrum, Kanban). Au cours de ma carrière, j'ai eu l'opportunité de travailler sur divers projets, allant de petites startups à de grandes entreprises, ce qui m'a permis de développer une flexibilité et une capacité d'adaptation exceptionnelles. Je suis particulièrement fier des projets où j'ai pu améliorer significativement l'expérience utilisateur et optimiser les performances des applications. Je crois fermement en l'importance d'une communication claire et efficace, que ce soit au sein d'une équipe ou avec les clients. Mon approche est axée sur la collaboration, l'innovation et la satisfaction des utilisateurs finaux. J'aime rester à la pointe des dernières technologies et tendances, en participant régulièrement à des conférences et en suivant des formations continues. En tant que développeur full stack, je suis constamment à la recherche de nouveaux défis et d'opportunités pour innover. Mon objectif est de continuer à créer des solutions technologiques qui non seulement répondent aux besoins actuels, mais anticipent également les futures demandes du marché. Si vous cherchez un partenaire technique dévoué et compétent, je suis prêt à transformer vos idées en réalité. \nContactez-moi pour discuter de vos projets et voir comment nous pouvons collaborer ensemble pour créer quelque chose d'extraordinaire.",
    "resume": {
        "tagline": "👋  Je suis développeur web full stack",
        "description": "J'ai livré des expériences utilisateur de classe mondiale à des millions de personnes. Je maîtrise parfaitement React, JavaScript et la plupart des frameworks web.",
        "experiences": [
            {
                "id": "1",
                "dates": "Septembre 2023 - Present",
                "type": "Alternance",
                "position": "Développeur full stack JS",
                "bullets": "GraphQL, NextJS, Typesript, AWS"
            },
            {
                "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
                "dates": "Janvier 2022 - Juiller 2022",
                "type": "Alternance",
                "position": "Développeur Backend",
                "bullets": "Big Data, Node.js"
            }
        ],
        "education": {
            "universityName": "ESIEA",
            "universityDate": "2021 - Présent",
            "universityPara": "Étudiant en cycle ingénieur spécialisé en intelligence artificiel "
        },
        "languages": [
            "Javascript",
            "Python",
            "C++"
        ],
        "frameworks": [
            "React",
            "Typescript",
            "NodeJs"
        ],
        "others": [
            "Figma",
            "AdobeXD",
            "AWS"
        ]
    }
}